Lembed/Lembed-Canduino-Firmware/Bootloaders/AT90CAN_boot.c
#elif defined __AVR_ATmega163__
#define SIG2	0x94
#define SIG3	0x02
#define PAGE_SIZE	0x40U	//64 words

#elif defined __AVR_ATmega169__
#define SIG2	0x94
#define SIG3	0x05
#define PAGE_SIZE	0x40U	//64 words

#elif defined __AVR_ATmega8515__
#define SIG2	0x93
#define SIG3	0x06
#define PAGE_SIZE	0x20U	//32 words

#elif defined __AVR_ATmega8535__
#define SIG2	0x93
#define SIG3	0x08
#define PAGE_SIZE	0x20U	//32 words
#endif


/* function prototypes */
void putch(char);
char getch(void);
void getNch(uint8_t);
void byte_response(uint8_t);
void nothing_response(void);
char gethex(void);
void puthex(char);
void flash_led(uint8_t);

/* some variables */
union address_union {
	uint16_t word;
	uint8_t  byte[2];
} address;

union length_union {
	uint16_t word;
	uint8_t  byte[2];
} length;

struct flags_struct {
	unsigned eeprom : 1;
	unsigned rampz  : 1;
} flags;

uint8_t buff[256];
uint8_t address_high;

uint8_t pagesz = 0x80;

uint8_t i;
uint8_t bootuart = 0;

uint8_t error_count = 0;

void (*app_start)(void) = 0x0000;


/* main program starts here */
int main(void)
{
	uint8_t ch, ch2;
	uint16_t w;

#ifdef WATCHDOG_MODS
	ch = MCUSR;
	MCUSR = 0;

	WDTCSR |= _BV(WDCE) | _BV(WDE);
	WDTCSR = 0;

	// Check if the WDT was used to reset, in which case we dont bootload and skip straight to the code. woot.
	if (! (ch &  _BV(EXTRF))) // if its a not an external reset...
		app_start();  // skip bootloader
#else
	asm volatile("nop\n\t");
#endif

	/* set pin direction for bootloader pin and enable pullup */
	/* for ATmega128, two pins need to be initialized */
#if defined __AVR_ATmega128__ // || defined __AVR_AT90CAN128__
	BL_DDR &= ~_BV(BL0);
	BL_DDR &= ~_BV(BL1);
	BL_PORT |= _BV(BL0);
	BL_PORT |= _BV(BL1);
#else
	/* We run the bootloader regardless of the state of this pin.  Thus, don't
	put it in a different state than the other pins.  --DAM, 070709
	This also applies to Arduino Mega -- DC, 080930
	BL_DDR &= ~_BV(BL);
	BL_PORT |= _BV(BL);
	*/
#endif


#if defined __AVR_ATmega128__ // || defined __AVR_AT90CAN128__
	/* check which UART should be used for booting */
	if (bit_is_clear(BL_PIN, BL0)) {
		bootuart = 1;
	} else if (bit_is_clear(BL_PIN, BL1)) {
		bootuart = 2;
	}
#endif

#if defined __AVR_ATmega1280__ || defined __AVR_AT90CAN128__
	/* the mega1280 chip has four serial ports ... we could eventually use any of them, or not? */
	/* however, we don't wanna confuse people, to avoid making a mess, we will stick to RXD0, TXD0 */
	bootuart = 1;
#endif

	/* check if flash is programmed already, if not start bootloader anyway */
	if (pgm_read_byte_near(0x0000) != 0xFF) {

#if defined __AVR_ATmega128__ // || defined __AVR_AT90CAN128__
		/* no UART was selected, start application */
		if (!bootuart) {
			app_start();
		}
#else
		/* check if bootloader pin is set low */
		/* we don't start this part neither for the m8, nor m168 */
		//if(bit_is_set(BL_PIN, BL)) {
		//      app_start();
		//    }
#endif
	}

#if defined __AVR_ATmega128__
	/* no bootuart was selected, default to uart 0 */
	if (!bootuart) {
		bootuart = 1;
	}
#endif


	/* initialize UART(s) depending on CPU defined */
#if defined(__AVR_ATmega128__) || defined __AVR_AT90CAN128__ || defined(__AVR_ATmega1280__)
	if (bootuart == 1) {
		UBRR0L = (uint8_t)(F_CPU / (BAUD_RATE * 16L) - 1);
		UBRR0H = (F_CPU / (BAUD_RATE * 16L) - 1) >> 8;
		UCSR0A = 0x00;
		UCSR0C = 0x06;
		UCSR0B = _BV(TXEN0) | _BV(RXEN0);
	}
	if (bootuart == 2) {
		UBRR1L = (uint8_t)(F_CPU / (BAUD_RATE * 16L) - 1);
		UBRR1H = (F_CPU / (BAUD_RATE * 16L) - 1) >> 8;
		UCSR1A = 0x00;
		UCSR1C = 0x06;
		UCSR1B = _BV(TXEN1) | _BV(RXEN1);
	}
#elif defined __AVR_ATmega163__
	UBRR = (uint8_t)(F_CPU / (BAUD_RATE * 16L) - 1);
	UBRRHI = (F_CPU / (BAUD_RATE * 16L) - 1) >> 8;
	UCSRA = 0x00;
	UCSRB = _BV(TXEN) | _BV(RXEN);
#elif defined(__AVR_ATmega168__) || defined(__AVR_ATmega328P__)

#ifdef DOUBLE_SPEED
	UCSR0A = (1 << U2X0); //Double speed mode USART0
	UBRR0L = (uint8_t)(F_CPU / (BAUD_RATE * 8L) - 1);
	UBRR0H = (F_CPU / (BAUD_RATE * 8L) - 1) >> 8;
#else
	UBRR0L = (uint8_t)(F_CPU / (BAUD_RATE * 16L) - 1);
	UBRR0H = (F_CPU / (BAUD_RATE * 16L) - 1) >> 8;
#endif

	UCSR0B = (1 << RXEN0) | (1 << TXEN0);
	UCSR0C = (1 << UCSZ00) | (1 << UCSZ01);

	/* Enable internal pull-up resistor on pin D0 (RX), in order
	to supress line noise that prevents the bootloader from
	timing out (DAM: 20070509) */
	DDRD &= ~_BV(PIND0);
	PORTD |= _BV(PIND0);
#elif defined __AVR_ATmega8__
	/* m8 */
	UBRRH = (((F_CPU / BAUD_RATE) / 16) - 1) >> 8; 	// set baud rate
	UBRRL = (((F_CPU / BAUD_RATE) / 16) - 1);
	UCSRB = (1 << RXEN) | (1 << TXEN); // enable Rx & Tx
	UCSRC = (1 << URSEL) | (1 << UCSZ1) | (1 << UCSZ0); // config USART; 8N1
#else
	/* m16,m32,m169,m8515,m8535 */
	UBRRL = (uint8_t)(F_CPU / (BAUD_RATE * 16L) - 1);
	UBRRH = (F_CPU / (BAUD_RATE * 16L) - 1) >> 8;
	UCSRA = 0x00;
	UCSRC = 0x06;
	UCSRB = _BV(TXEN) | _BV(RXEN);
#endif

#if defined __AVR_ATmega1280__ || defined __AVR_AT90CAN128__
	/* Enable internal pull-up resistor on pin E0 (RX), in order
	to supress line noise that prevents the bootloader from
	timing out (DAM: 20070509) */
	/* feature added to the Arduino Mega --DC: 080930 */
	DDRE &= ~_BV(PINE0);
	PORTE |= _BV(PINE0);
#endif


	/* set LED pin as output */
	LED_DDR |= _BV(LED);


	/* flash onboard LED to signal entering of bootloader */
	flash_led(NUM_LED_FLASHES);

	/* 20050803: by DojoCorp, this is one of the parts provoking the
		 system to stop listening, cancelled from the original */
	//putch('\0');

	/* forever loop */
	for (;;) {

		/* get character from UART */
		ch = getch();

		/* A bunch of if...else if... gives smaller code than switch...case ! */

		/* Hello is anyone home ? */
		if (ch == '0') {
			nothing_response();
		}


		/* Request programmer ID */
		/* Not using PROGMEM string due to boot block in m128 being beyond 64kB boundry  */
		/* Would need to selectively manipulate RAMPZ, and it's only 9 characters anyway so who cares.  */
		else if (ch == '1') {
			if (getch() == ' ') {
				putch(0x14);
				putch('A');
				putch('V');
				putch('R');
				putch(' ');
				putch('I');
				putch('S');
				putch('P');
				putch(0x10);
			} else {
				if (++error_count == MAX_ERROR_COUNT)
					app_start();
			}
		}


		/* AVR ISP/STK500 board commands  DON'T CARE so default nothing_response */
		else if (ch == '@') {
			ch2 = getch();
			if (ch2 > 0x85) getch();
			nothing_response();
		}


		/* AVR ISP/STK500 board requests */
		else if (ch == 'A') {
			ch2 = getch();
			if (ch2 == 0x80) byte_response(HW_VER);		// Hardware version
			else if (ch2 == 0x81) byte_response(SW_MAJOR);	// Software major version
			else if (ch2 == 0x82) byte_response(SW_MINOR);	// Software minor version
			else if (ch2 == 0x98) byte_response(0x03);		// Unknown but seems to be required by avr studio 3.56
			else byte_response(0x00);				// Covers various unnecessary responses we don't care about
		}


		/* Device Parameters  DON'T CARE, DEVICE IS FIXED  */
		else if (ch == 'B') {
			getNch(20);
			nothing_response();
		}


		/* Parallel programming stuff  DON'T CARE  */
		else if (ch == 'E') {
			getNch(5);
			nothing_response();
		}


		/* P: Enter programming mode  */
		/* R: Erase device, don't care as we will erase one page at a time anyway.  */
		else if (ch == 'P' || ch == 'R') {
			nothing_response();
		}


		/* Leave programming mode  */
		else if (ch == 'Q') {
			nothing_response();
#ifdef WATCHDOG_MODS
			// autoreset via watchdog (sneaky!)
			WDTCSR = _BV(WDE);
			while (1); // 16 ms
#endif
		}


		/* Set address, little endian. EEPROM in bytes, FLASH in words  */
		/* Perhaps extra address bytes may be added in future to support > 128kB FLASH.  */
		/* This might explain why little endian was used here, big endian used everywhere else.  */
		else if (ch == 'U') {
			address.byte[0] = getch();
			address.byte[1] = getch();
			nothing_response();
		}


		/* Universal SPI programming command, disabled.  Would be used for fuses and lock bits.  */
		else if (ch == 'V') {
			if (getch() == 0x30) {
				getch();
				ch = getch();
				getch();
				if (ch == 0) {
					byte_response(SIG1);
				} else if (ch == 1) {
					byte_response(SIG2);
				} else {
					byte_response(SIG3);
				}
			} else {
				getNch(3);
				byte_response(0x00);
			}
		}


		/* Write memory, length is big endian and is in bytes  */
		else if (ch == 'd') {
			length.byte[1] = getch();
			length.byte[0] = getch();
			flags.eeprom = 0;
			if (getch() == 'E') flags.eeprom = 1;
			for (w = 0; w < length.word; w++) {
				buff[w] = getch();	                        // Store data in buffer, can't keep up with serial data stream whilst programming pages
			}
			if (getch() == ' ') {
				if (flags.eeprom) {		                //Write to EEPROM one byte at a time
					address.word <<= 1;
					for (w = 0; w < length.word; w++) {
#if defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__)
						while (EECR & (1 << EEPE));
						EEAR = (uint16_t)(void *)address.word;
						EEDR = buff[w];
						EECR |= (1 << EEMPE);
						EECR |= (1 << EEPE);
#else
						eeprom_write_byte((void *)address.word, buff[w]);
#endif
						address.word++;
					}
				} else {					      //Write to FLASH one page at a time
					if (address.byte[1] > 127) address_high = 0x01;	//Only possible with m128, m256 will need 3rd address byte. FIXME
					else address_high = 0x00;
#if defined(__AVR_ATmega128__) || defined (__AVR_AT90CAN128__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega1281__)
					RAMPZ = address_high;
#endif
					address.word = address.word << 1;	        //address * 2 -> byte location
					/* if ((length.byte[0] & 0x01) == 0x01) length.word++;	//Even up an odd number of bytes */
					if ((length.byte[0] & 0x01)) length.word++;	//Even up an odd number of bytes
					cli();					//Disable interrupts, just to be sure
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega1281__)
					while (bit_is_set(EECR, EEPE));			//Wait for previous EEPROM writes to complete
#else
					while (bit_is_set(EECR, EEWE));			//Wait for previous EEPROM writes to complete
#endif
					asm volatile(
					    "clr	r17		\n\t"	//page_word_count
					    "lds	r30,address	\n\t"	//Address of FLASH location (in bytes)
					    "lds	r31,address+1	\n\t"
					    "ldi	r28,lo8(buff)	\n\t"	//Start of buffer array in RAM
					    "ldi	r29,hi8(buff)	\n\t"
					    "lds	r24,length	\n\t"	//Length of data to be written (in bytes)
					    "lds	r25,length+1	\n\t"
					    "length_loop:		\n\t"	//Main loop, repeat for number of words in block
					    "cpi	r17,0x00	\n\t"	//If page_word_count=0 then erase page
					    "brne	no_page_erase	\n\t"
					    "wait_spm1:		\n\t"
					    "lds	r16,%0		\n\t"	//Wait for previous spm to complete
					    "andi	r16,1           \n\t"
					    "cpi	r16,1           \n\t"
					    "breq	wait_spm1       \n\t"
					    "ldi	r16,0x03	\n\t"	//Erase page pointed to by Z
					    "sts	%0,r16		\n\t"
					    "spm			\n\t"
#ifdef __AVR_ATmega163__
					    ".word 0xFFFF		\n\t"
					    "nop			\n\t"
#endif
					    "wait_spm2:		\n\t"
					    "lds	r16,%0		\n\t"	//Wait for previous spm to complete
					    "andi	r16,1           \n\t"
					    "cpi	r16,1           \n\t"
					    "breq	wait_spm2       \n\t"

					    "ldi	r16,0x11	\n\t"	//Re-enable RWW section
					    "sts	%0,r16		\n\t"
					    "spm			\n\t"
#ifdef __AVR_ATmega163__
					    ".word 0xFFFF		\n\t"
					    "nop			\n\t"
#endif
					    "no_page_erase:		\n\t"
					    "ld	r0,Y+		\n\t"	//Write 2 bytes into page buffer
					    "ld	r1,Y+		\n\t"

