Lembed/Lembed-Canduino-Firmware/Bootloaders/AT90CAN_boot.c
					    "wait_spm3:		\n\t"
					    "lds	r16,%0		\n\t"	//Wait for previous spm to complete
					    "andi	r16,1           \n\t"
					    "cpi	r16,1           \n\t"
					    "breq	wait_spm3       \n\t"
					    "ldi	r16,0x01	\n\t"	//Load r0,r1 into FLASH page buffer
					    "sts	%0,r16		\n\t"
					    "spm			\n\t"

					    "inc	r17		\n\t"	//page_word_count++
					    "cpi r17,%1	        \n\t"
					    "brlo	same_page	\n\t"	//Still same page in FLASH
					    "write_page:		\n\t"
					    "clr	r17		\n\t"	//New page, write current one first
					    "wait_spm4:		\n\t"
					    "lds	r16,%0		\n\t"	//Wait for previous spm to complete
					    "andi	r16,1           \n\t"
					    "cpi	r16,1           \n\t"
					    "breq	wait_spm4       \n\t"
#ifdef __AVR_ATmega163__
					    "andi	r30,0x80	\n\t"	// m163 requires Z6:Z1 to be zero during page write
#endif
					    "ldi	r16,0x05	\n\t"	//Write page pointed to by Z
					    "sts	%0,r16		\n\t"
					    "spm			\n\t"
#ifdef __AVR_ATmega163__
					    ".word 0xFFFF		\n\t"
					    "nop			\n\t"
					    "ori	r30,0x7E	\n\t"	// recover Z6:Z1 state after page write (had to be zero during write)
#endif
					    "wait_spm5:		\n\t"
					    "lds	r16,%0		\n\t"	//Wait for previous spm to complete
					    "andi	r16,1           \n\t"
					    "cpi	r16,1           \n\t"
					    "breq	wait_spm5       \n\t"
					    "ldi	r16,0x11	\n\t"	//Re-enable RWW section
					    "sts	%0,r16		\n\t"
					    "spm			\n\t"
#ifdef __AVR_ATmega163__
					    ".word 0xFFFF		\n\t"
					    "nop			\n\t"
#endif
					    "same_page:		\n\t"
					    "adiw	r30,2		\n\t"	//Next word in FLASH
					    "sbiw	r24,2		\n\t"	//length-2
					    "breq	final_write	\n\t"	//Finished
					    "rjmp	length_loop	\n\t"
					    "final_write:		\n\t"
					    "cpi	r17,0		\n\t"
					    "breq	block_done	\n\t"
					    "adiw	r24,2		\n\t"	//length+2, fool above check on length after short page write
					    "rjmp	write_page	\n\t"
					    "block_done:		\n\t"
					    "clr	__zero_reg__	\n\t"	//restore zero register
#if defined __AVR_ATmega168__  || __AVR_ATmega328P__ || __AVR_ATmega128__ || __AVR_AT90CAN128__ || __AVR_ATmega1280__ || __AVR_ATmega1281__
					    : "=m" (SPMCSR) : "M" (PAGE_SIZE) : "r0", "r16", "r17", "r24", "r25", "r28", "r29", "r30", "r31"
#else
					    : "=m" (SPMCR) : "M" (PAGE_SIZE) : "r0", "r16", "r17", "r24", "r25", "r28", "r29", "r30", "r31"
#endif
					);
					/* Should really add a wait for RWW section to be enabled, don't actually need it since we never */
					/* exit the bootloader without a power cycle anyhow */
				}
				putch(0x14);
				putch(0x10);
			} else {
				if (++error_count == MAX_ERROR_COUNT)
					app_start();
			}
		}


		/* Read memory block mode, length is big endian.  */
		else if (ch == 't') {
			length.byte[1] = getch();
			length.byte[0] = getch();
#if defined(__AVR_ATmega128__) || defined(__AVR_AT90CAN128__)|| defined(__AVR_ATmega1280__)
			if (address.word > 0x7FFF) flags.rampz = 1;		// No go with m256, FIXME
			else flags.rampz = 0;
#endif
			address.word = address.word << 1;	        // address * 2 -> byte location
			if (getch() == 'E') flags.eeprom = 1;
			else flags.eeprom = 0;
			if (getch() == ' ') {		                // Command terminator
				putch(0x14);
				for (w = 0; w < length.word; w++) {		    // Can handle odd and even lengths okay
					if (flags.eeprom) {	                        // Byte access EEPROM read
#if defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__)
						while (EECR & (1 << EEPE));
						EEAR = (uint16_t)(void *)address.word;
						EECR |= (1 << EERE);
						putch(EEDR);
#else
						putch(eeprom_read_byte((void *)address.word));
#endif
						address.word++;
					} else {

						if (!flags.rampz) putch(pgm_read_byte_near(address.word));
#if defined(__AVR_ATmega128__) || defined(__AVR_AT90CAN128__) || defined(__AVR_ATmega1280__)
						else putch(pgm_read_byte_far(address.word + 0x10000));
						// Hmmmm, yuck  FIXME when m256 arrvies
#endif
						address.word++;
					}
				}
				putch(0x10);
			}
		}


		/* Get device signature bytes  */
		else if (ch == 'u') {
			if (getch() == ' ') {
				putch(0x14);
				putch(SIG1);
				putch(SIG2);
				putch(SIG3);
				putch(0x10);
			} else {
				if (++error_count == MAX_ERROR_COUNT)
					app_start();
			}
		}


		/* Read oscillator calibration byte */
		else if (ch == 'v') {
			byte_response(0x00);
		}


#if defined MONITOR

		/* here come the extended monitor commands by Erik Lins */

		/* check for three times exclamation mark pressed */
		else if (ch == '!') {
			ch = getch();
			if (ch == '!') {
				ch = getch();
				if (ch == '!') {
					PGM_P welcome = "";
#if defined(__AVR_ATmega128__) || defined(__AVR_AT90CAN128__) || defined(__AVR_ATmega1280__)
					uint16_t extaddr;
#endif
					uint8_t addrl, addrh;
#ifdef CRUMB128
					welcome = "ATmegaBOOT / Crumb128 - (C) J.P.Kyle, E.Lins - 050815\n\r";
#elif defined PROBOMEGA128
					welcome = "ATmegaBOOT / PROBOmega128 - (C) J.P.Kyle, E.Lins - 050815\n\r";
#elif defined SAVVY128
					welcome = "ATmegaBOOT / Savvy128 - (C) J.P.Kyle, E.Lins - 050815\n\r";
#elif defined __AVR_ATmega1280__
					welcome = "ATmegaBOOT / Arduino Mega - (C) Arduino LLC - 090930\n\r";
#elif defined __AVR_AT90CAN128__
					welcome = "Canduino / AT90CAN128 - (C) lembed.org - 150909\n\r";
#endif

					/* turn on LED */
					LED_DDR |= _BV(LED);
#if defined(__AVR_AT90CAN128__)
					LED_PORT |= _BV(LED);
#else
					LED_PORT &= ~_BV(LED);
#endif

					/* print a welcome message and command overview */
					for (i = 0; welcome[i] != '\0'; ++i) {
						putch(welcome[i]);
					}

					/* test for valid commands */
					for (;;) {
						putch('\n');
						putch('\r');
						putch(':');
						putch(' ');

						ch = getch();
						putch(ch);

						/* toggle LED */
						if (ch == 't') {
							if (bit_is_set(LED_PIN, LED)) {
								LED_PORT &= ~_BV(LED);
								putch('1');
							} else {
								LED_PORT |= _BV(LED);
								putch('0');
							}
						}

						/* read byte from address */
						else if (ch == 'r') {
							ch = getch(); putch(ch);
							addrh = gethex();
							addrl = gethex();
							putch('=');
							ch = *(uint8_t *)((addrh << 8) + addrl);
							puthex(ch);
						}

						/* write a byte to address  */
						else if (ch == 'w') {
							ch = getch(); putch(ch);
							addrh = gethex();
							addrl = gethex();
							ch = getch(); putch(ch);
							ch = gethex();
							*(uint8_t *)((addrh << 8) + addrl) = ch;
						}

